soiv-dmp-test/src/main/resources/com/ericsson/soiv/teststeps/protocols/bscs/GetUsageEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:usag="http://ericsson.com/services/ws_CIL_7/usagedatarecordsread" xmlns:ses="http://ericsson.com/services/ws_CIL_7/sessionchange">
<soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>ADMX</Username>
                <Password>ADMX</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <usag:usageDataRecordsReadRequest>
            <usag:inputAttributes>
                <usag:callingparty>{{msisdn}}</usag:callingparty>
                <usag:searchLimit>{{searchLimit}}</usag:searchLimit>
                <usag:csIdPub>{{customerId}}</usag:csIdPub>
            </usag:inputAttributes>
            <usag:sessionChangeRequest>
                <ses:values>
                    <ses:item>
                        <ses:key>BU_ID</ses:key>
                        <ses:value>2</ses:value>
                    </ses:item>
                </ses:values>
            </usag:sessionChangeRequest>
        </usag:usageDataRecordsReadRequest>
    </soapenv:Body>
</soapenv:Envelope>